app/controllers/movies_controller.rb

  def index
	#local vars
	@titleSetCss = false
	@releaseDateSetCss = false
	@redirectRating = false
	@redirectTitle = false
	@redirectDate = false

	#get's the ratings list
	@all_ratings = Array.new()
	Movie.all(:select => "DISTINCT rating").each { |r| @all_ratings.push(r.rating) }
---
SELECT "movies".* FROM "movies" WHERE (rating IN (NULL))